"""'initial_1'

Revision ID: bb839ad61e77
Revises: 6085938fc2a1
Create Date: 2023-02-02 01:54:13.932119

"""
import sqlalchemy as sa
from sqlalchemy.orm import Session


# revision identifiers, used by Alembic.
from models import create_sync_session, Questions
from sqlalchemy.exc import IntegrityError


# revision identifiers, used by Alembic.
revision = 'bb839ad61e77'
down_revision = '6085938fc2a1'
branch_labels = None
depends_on = None

questions = {
    '1': {"answer": "1", "description": "Используется продукт размороженный не полностью Крылья -0.4, погрешность 0.0, допущены к реализации"},
    '2': {"answer": "3", "description": "Не положили влажную салфетку"},
    '3': {"answer": "1", "description": "Нет крышки Пищевые отходы выбрасываются в ведро без крышки"},
    '4': {"answer": "1", "description": "Ржавчина Ржавчина на полозьях в холодильной камере"},
    '5': {"answer": "3", "description": "Плохое качество масла( по ЗМ полоскам или тестеру)"},

    '6': {"answer": "1", "description": "Температура в морозильном ларе - 16.3С"},
    '7': {"answer": "1", "description": "Колеса шкафа в жировом наслоении"},
    '8': {"answer": "1", "description": "Жировые наслоения на жаровне "},
    '9': {"answer": "1", "description": "Лук +6.2, погрешность +0.1, срок ок"},
    '10': {"answer": "1", "description": "Зингер +57,1 погресность +0,1, срок ок"},

    '11': {"answer": "1", "description": "Филе классик +58,3 погрешность +0.1, срок ок"},
    '12': {"answer": "1", "description": "Нет общей маркировки, не указано количество размораживаемых донатов"},
    '13': {"answer": "1", "description": "ОС: Масло храниться над мукой"},
    '14': {"answer": "1", "description": "Стаканы хранятся в месте, где проходит коммуникация Coca Cola и кофемашины"},
    '15': {"answer": "1", "description": "Остатки маркировки на гастроемкостях"},

    '16': {"answer": "1", "description": "Мука на дверце теплового шкафа"},
    '17': {"answer": "1", "description": "Порван уплотнитель холодильника на саладете, заявки нет"},
    '18': {"answer": "1", "description": "Холодильник -2.8, погрешность +0.1"},
    '19': {"answer": "1", "description": "Упаковка используется под хранение канцелярии"},
    '20': {"answer": "1", "description": "Не читаем срок годности"},

    '21': {"answer": "3", "description": "Уровень масла низкий"},
    '22': {"answer": "1", "description": "Температура томатов +6.3(после 1 часа охлаждения)"},
    '23': {"answer": "1", "description": "За текущий день не заполнены журналы в DSR"},
    '24': {"answer": "1", "description": "Отсутствует маркировка по сроку годности"},
    '25': {"answer": "1", "description": "Колеса панировочного стола загрязнены"},

    '26': {"answer": "1", "description": "Решетки вытяжного зонта в наслоении"},
    '27': {"answer": "1", "description": "Температура воды ниже +49С Погрешность термометра 0.0, температура 43.2 градуса"},
    '28': {"answer": "3", "description": "Филе на хранении с отслаивающейся панировкой"},
    '29': {"answer": "3", "description": "Нет таймера на фри"},
    '30': {"answer": "3", "description": "Картофель фри не соленый(пресный)"},

    '31': {"answer": "3", "description": "На 4 полке стрипсы, таймера нет, температура ок"},
    '32': {"answer": "3", "description": "Бумажного часовщика нет, электрический часовщик выключен"},
    '33': {"answer": "2", "description": "Голень после выдержки 7 минут в ТШ имеет температуру 72.6"},
    '34': {"answer": "1", "description": "'Скуратович' не записан в журнале здоровья в день аудита"},
    '35': {"answer": "1", "description": "Грязный мусорный бак в зале"},

    '36': {"answer": "1", "description": "Грязный зеленый совок на хранении"},
    '37': {"answer": "3", "description": "Филе классик без панировки"},
    '38': {"answer": "1", "description": "Жировые наслоения на сетках в зоне чистого инвентаря"},
    '39': {"answer": "3", "description": "Чизбургер с таймером '1 красная' в '4 черное'"},
    '40': {"answer": "2", "description": "Следы перемаркировки"},

    '41': {"answer": "1", "description": "Бекон в гастроемкости +7.3С, время выкладки не превышает 4 часа"},
    '42': {"answer": "1", "description": "Неутвержденные губки в ресторане"},
    '43': {"answer": "1", "description": "Сток в моповой загрязнен"},
    '44': {"answer": "1", "description": "Первичную упаковку занесли в производственную зону"},
    '45': {"answer": "1", "description": "Мука на поверхности ТШ"},

    '46': {"answer": "2", "description": "Пакер дважды потрогала маску, приступила к сбору заказа"},
    '47': {"answer": "1", "description": "Сырой продукт опустили рядом с готовым продуктом"},
    '48': {"answer": "1", "description": "В зале используют синюю салфетку(чистая, без следов использования)"},
    '49': {"answer": "1", "description": "Нет ловушки в зале"},
    '50': {"answer": "1", "description": "Отсутствуют щипцы, пистолеты/дозаторы для замены во время..."},

    '51': {"answer": "1", "description": "Мука на поверхности выкладки готового продукта"},
    '52': {"answer": "2", "description": "Острые стрипсы +6.9, погрешность 0.0, размораживается обычным"},
    '53': {"answer": "2", "description": "Байтсы в ТШ +54.5С"},
    '54': {"answer": "1", "description": "Байтсы -0.5С и на местами еще твердые замороженные - допущены"},
    '55': {"answer": "1", "description": "На саладете Используют синий инвентарь"},

    '56': {"answer": "2", "description": "Температура воды в трехсекционной раковине 41 градус "},
    '57': {"answer": "1", "description": "Температура воды в трехсекционной раковине 48 градусов "},
    '58': {"answer": "5", "description": "Температура воды в трехсекционной раковине 51 градус"},
    '59': {"answer": "2", "description": "На трехсекционной мойке отсутствует K-214 во время мытья посуды"},
    '60': {"answer": "1", "description": "Температура воды в раковине на первой линии +30.2С"},

    '61': {"answer": "2", "description": "Живой таракан на стене в служебной зоне"},
    '62': {"answer": "2", "description": "Погрешность термометра +0,3 градусов, температура куриного п/ф – 4.2 градуса, таймер от ресторана ок, таймера от производителя нет"},
    '63': {"answer": "2", "description": "Погрешность термометра +0,4 градуса, температура куриного п/ф – 4.9 градуса, таймер от ресторана ок, таймер от производителя ок"},
    '64': {"answer": "2", "description": "Погрешность термометра 0,0 градусов, температура куриного п/ф – 5.2 градуса, таймер от ресторана ок, таймер от производителя ок"},
    '65': {"answer": "2", "description": "Погрешность термометра +0,3 градусов, температура куриного п/ф – 4.0 градуса, таймер от ресторана просрочен, таймер от производителя ок"},

    '66': {"answer": "2", "description": "Погрешность термометра +0,3 градусов, температура куриного п/ф – 3.7 градуса, таймер от ресторана отсутствует, таймер от производителя ок"},
    '67': {"answer": "1", "description": "Погрешность термометра 0,0 градусов, температура куриного п/ф – -0.2 градуса, таймер от ресторана ок, таймер от производителя ок"},
    '68': {"answer": "1", "description": "Не продезинфицировали поверхность перед поднятием продукта"},
    '69': {"answer": "2", "description": "На смене сотрудник с симптомами заболевания"},
    '70': {"answer": "2", "description": "Баллон CO2 для пива подключен к Cocа-Cola"},

    '71': {"answer": "2", "description": "Синяя салфетка (использованная), хранится в ведре зеленого цвета"},
    '72': {"answer": "1", "description": "Сотрудник на панеровке работает без сеточки"},
    '73': {"answer": "1", "description": "Температура томатов на саладете +4.3 градуса, таймер просрочен на 1 час"},
    '74': {"answer": "1", "description": "Температура лука на саладете +6 градусов, таймер ок"},
    '75': {"answer": "1", "description": "Температура лука на саладете +11,5 градусов, таймер ок "},

    '76': {"answer": "2", "description": "Температура лука на саладете +12 градусов, таймер ок "},
    '77': {"answer": "2", "description": "Температура томатов на саладете +5,2 градусов, таймер просрочен на 20 минут "},
    '78': {"answer": "1", "description": "Температура томатов на саладете +3,5 градусов, таймера на гастроемкости нет "},
    '79': {"answer": "1", "description": "Температура бекона в гастроемкости +5,4 градуса. После выкладки в гастроемкость (по таймеру), прошло 2,5 часа."},

'80': {"answer": "1", "description": "Байтсы в ТШ +54.5С Таймер на тепловом шкафу ок"},
    '81': {"answer": "1", "description": "Температура стрипсов OR +58.1С Таймер на тепловом шкафу ок"},
    '82': {"answer": "2", "description": "Топинг +15.2, хранится в выключенном холодильнике, таймера нет"},
    '83': {"answer": "2", "description": "Сотрудник после того, как выдал сдачу гостю, не вымыл руки и начал собирать заказ"},
    '84': {"answer": "2", "description": "Сотрудник вымыл руки, не использовал антисептик, пошел собирать заказ "},
    '85': {"answer": "1", "description": "Концентрация раствора в ведре на кухне 1%."},

    '86': {"answer": "2", "description": "Сотрудник вымыл руки во время того, набиралась вода в ведро для погружной корзины. Выберите отклонение"},
    '87': {"answer": "1", "description": "Сотрудник на панеровке работает без сеточки. Выберите отклонение"},
    '88': {"answer": "3", "description": "Неправильные настройки на приготовление оригинальных стрипсов"},
    '89': {"answer": "1", "description": "Три рукомойника не обеспечены бумагой для рук"},
    '90': {"answer": "2", "description": "Бутылка с шоколадным сиропом для коктейлей просрочена по этикетке от производителя"},

    '91': {"answer": "1", "description": "Пакеты хранятся открытыми"},
    '92': {"answer": "3", "description": "Отсутствует таймер на готовом картофеле фри"},
    '93': {"answer": "1", "description": "Нарощенные ресницы у сотрудника"},
    '94': {"answer": "1", "description": "Отмечают внешние ловушки, которых нет на схеме в ресторане"},
    '95': {"answer": "3", "description": "Форсунки ансул не направлены на винстон"},

    '96': {"answer": "1", "description": "Нет памятки по процедуре мытья рук"},
    '97': {"answer": "3", "description": "Отсутствующие позиции в меню заклеены стикерами"},
    '98': {"answer": "3", "description": "Сломан тестер (Нет устройства для измерения масла)"},
    '99': {"answer": "1", "description": "Топинг промаркирован более чем на 28 дней"},
    '100': {"answer": "1", "description": "Перемаркированы томаты в процессе аудита"},

}


@create_sync_session
def upgrade(session: Session = None) -> None:
    for question, questions_item in questions.items():
        _questions = Questions(img_id=question,
                               answer=questions_item['answer'],
                               description=questions_item['description'])
        session.add(_questions)
        try:
            session.commit()
        except IntegrityError:
            pass


@create_sync_session
def downgrade(session: Session = None) -> None:
    for question in questions:
        session.execute(
            sa.delete(Questions)
            .where(Questions.img_id == question)
        )
        session.commit()
